# Introduction to Deep Learning

## Objectives
In this lab, you will embark on the journey of creating a ANN, DNN model tailored for predicting the total expenditure of potential consumers based on various characteristics. As a vehicle salesperson, your goal is to develop a model that can effectively estimate the overall spending potential.

Your task is to build and train an ANN/DNN model using tensorflow in a Jupyter notebook.

Feel Free to Explore the dataset, analyze its contents, and derive meaningful insights. Additionally, feel empowered to create insightful visualizations that enhance the understanding of the data.

# Step 1: Import Libraries

In [281]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import StandardScaler
from sklearn.metrics import accuracy_score, confusion_matrix
from tensorflow.keras.models import Sequential
from tensorflow.keras.layers import Dense

# Step 2: Load and Explore the Data

In [282]:
# Write your code ^_^
df = pd.read_csv('car_purchasing.csv',encoding='latin')
df

,customer name,customer e-mail,country,gender,age,annual Salary,credit card debt,net worth,car purchase amount
0,Martina Avila,cubilia.Curae.Phasellus@quisaccumsanconvallis.edu,Bulgaria,0,41.851720,62812.09301,11609.380910,238961.2505,35321.45877
1,Harlan Barnes,eu.dolor@diam.co.uk,Belize,0,40.870623,66646.89292,9572.957136,530973.9078,45115.52566
2,Naomi Rodriquez,vulputate.mauris.sagittis@ametconsectetueradip...,Algeria,1,43.152897,53798.55112,11160.355060,638467.1773,42925.70921
3,Jade Cunningham,malesuada@dignissim.com,Cook Islands,1,58.271369,79370.03798,14426.164850,548599.0524,67422.36313
4,Cedric Leach,felis.ullamcorper.viverra@egetmollislectus.net,Brazil,1,57.313749,59729.15130,5358.712177,560304.0671,55915.46248
...,...,...,...,...,...,...,...,...,...
495,Walter,ligula@Cumsociis.ca,Nepal,0,41.462515,71942.40291,6995.902524,541670.1016,48901.44342
496,Vanna,Cum.sociis.natoque@Sedmolestie.edu,Zimbabwe,1,37.642000,56039.49793,12301.456790,360419.0988,31491.41457
497,Pearl,penatibus.et@massanonante.com,Philippines,1,53.943497,68888.77805,10611.606860,764531.3203,64147.28888
498,Nell,Quisque.varius@arcuVivamussit.net,Botswana,1,59.160509,49811.99062,14013.034510,337826.6382,45442.15353
499,Marla,Camaron.marla@hotmail.com,marlal,1,46.731152,61370.67766,9391.341628,462946.4924,45107.22566

In [283]:
df[df['country']=='Israel']=df[df['country']=='Israel'].replace('Israel',np.NaN)

In [284]:
con=df['country'].value_counts().index.tolist()
for i in range(len(con)):
    print(con[i])

Bolivia
Mauritania
Iraq
Kyrgyzstan
Guinea
Samoa
Saint BarthÃ©lemy
Greenland
Laos
Armenia
Bhutan
Liechtenstein
Equatorial Guinea
Algeria
Grenada
Saint Vincent and The Grenadines
Senegal
Egypt
Sierra Leone
Marshall Islands
Sao Tome and Principe
Guam
Namibia
Venezuela
Andorra
French Polynesia
Saint Pierre and Miquelon
Saint Kitts and Nevis
Madagascar
Isle of Man
Cocos (Keeling) Islands
Northern Mariana Islands
Croatia
Uruguay
Macao
Jersey
Chile
Poland
Ecuador
Palestine, State of
China
United Arab Emirates
Dominican Republic
Puerto Rico
United States Minor Outlying Islands
Kiribati
Slovakia
Tuvalu
Nepal
Gambia
Yemen
Uganda
Kuwait
Bouvet Island
Wallis and Futuna
South Africa
Guadeloupe
Martinique
Latvia
Maldives
Belize
Mayotte
Brazil
Christmas Island
Falkland Islands
Solomon Islands
Congo (Brazzaville)
Micronesia
Djibouti
Turks and Caicos Islands
Turkmenistan
Suriname
Macedonia
Timor-Leste
Ã…land Islands
Mauritius
Colombia
Mozambique
Benin
Cape Verde
Jamaica
Costa Rica
Iceland
Viet Nam
Portugal
Tokelau
Turkey
Luxembourg
Belarus
Guernsey
Guatemala
Bahamas
Thailand
Bosnia and Herzegovina
Papua New Guinea
Greece
Canada
Zimbabwe
Malawi
Philippines
Korea, South
Haiti
Western Sahara
Lithuania
Morocco
United States
Niue
Bermuda
Norfolk Island
Faroe Islands
Italy
French Southern Territories
Malta
Bangladesh
India
Afghanistan
Saint Martin
Antarctica
Virgin Islands, British
Heard Island and Mcdonald Islands
CuraÃ§ao
Bulgaria
Austria
Ghana
Anguilla
Angola
Syria
Paraguay
Slovenia
Czech Republic
Guinea-Bissau
Mongolia
Vanuatu
Somalia
Argentina
Sint Maarten
French Guiana
Ethiopia
France
Botswana
Nigeria
Indonesia
Jordan
Tunisia
Pakistan
Myanmar
Liberia
Qatar
Serbia
Bahrain
San Marino
Seychelles
Nicaragua
Switzerland
Malaysia
Montenegro
United Kingdom (Great Britain)
Saint Helena, Ascension and Tristan da Cunha
Gabon
Chad
Sudan
American Samoa
New Zealand
South Georgia and The South Sandwich Islands
Australia
Ukraine
South Sudan
Cook Islands
Belgium
Mali
New Caledonia
Niger
Hungary
Cayman Islands
Honduras
Mexico
Rwanda
Tonga
Tanzania
Moldova
Kenya
Monaco
Lebanon
Aruba
Hong Kong
Japan
Saint Lucia
Saudi Arabia
Singapore
Togo
Central African Republic
Cameroon
Guyana
Palau
Kazakhstan
Reunion
Germany
Virgin Islands, United States
Sri Lanka
Taiwan
Nauru
Georgia
Cambodia
Peru
Bonaire, Sint Eustatius and Saba
El Salvador
Denmark
Oman
Trinidad and Tobago
marlal

In [285]:
df.isna().sum()

customer name          0
customer e-mail        0
country                6
gender                 0
age                    0
annual Salary          0
credit card debt       0
net worth              0
car purchase amount    0
dtype: int64

In [286]:
df.dropna(inplace=True)

In [287]:
df.isna().sum()

customer name          0
customer e-mail        0
country                0
gender                 0
age                    0
annual Salary          0
credit card debt       0
net worth              0
car purchase amount    0
dtype: int64

# Step 3: Data Cleaning and Preprocessing


**Hint: You could use a `StandardScaler()` or `MinMaxScaler()`**

In [288]:
df.drop(columns=['customer name', 'customer e-mail'],inplace=True)

In [289]:
from sklearn import preprocessing

le = preprocessing.LabelEncoder()

le.fit(
    df['country']
)

list(le.classes_)

['Afghanistan',
 'Algeria',
 'American Samoa',
 'Andorra',
 'Angola',
 'Anguilla',
 'Antarctica',
 'Argentina',
 'Armenia',
 'Aruba',
 'Australia',
 'Austria',
 'Bahamas',
 'Bahrain',
 'Bangladesh',
 'Belarus',
 'Belgium',
 'Belize',
 'Benin',
 'Bermuda',
 'Bhutan',
 'Bolivia',
 'Bonaire, Sint Eustatius and Saba',
 'Bosnia and Herzegovina',
 'Botswana',
 'Bouvet Island',
 'Brazil',
 'Bulgaria',
 'Cambodia',
 'Cameroon',
 'Canada',
 'Cape Verde',
 'Cayman Islands',
 'Central African Republic',
 'Chad',
 'Chile',
 'China',
 'Christmas Island',
 'Cocos (Keeling) Islands',
 'Colombia',
 'Congo (Brazzaville)',
 'Cook Islands',
 'Costa Rica',
 'Croatia',
 'CuraÃ§ao',
 'Czech Republic',
 'Denmark',
 'Djibouti',
 'Dominican Republic',
 'Ecuador',
 'Egypt',
 'El Salvador',
 'Equatorial Guinea',
 'Ethiopia',
 'Falkland Islands',
 'Faroe Islands',
 'France',
 'French Guiana',
 'French Polynesia',
 'French Southern Territories',
 'Gabon',
 'Gambia',
 'Georgia',
 'Germany',
 'Ghana',
 'Greece',
 'Greenland',
 'Grenada',
 'Guadeloupe',
 'Guam',
 'Guatemala',
 'Guernsey',
 'Guinea',
 'Guinea-Bissau',
 'Guyana',
 'Haiti',
 'Heard Island and Mcdonald Islands',
 'Honduras',
 'Hong Kong',
 'Hungary',
 'Iceland',
 'India',
 'Indonesia',
 'Iraq',
 'Isle of Man',
 'Italy',
 'Jamaica',
 'Japan',
 'Jersey',
 'Jordan',
 'Kazakhstan',
 'Kenya',
 'Kiribati',
 'Korea, South',
 'Kuwait',
 'Kyrgyzstan',
 'Laos',
 'Latvia',
 'Lebanon',
 'Liberia',
 'Liechtenstein',
 'Lithuania',
 'Luxembourg',
 'Macao',
 'Macedonia',
 'Madagascar',
 'Malawi',
 'Malaysia',
 'Maldives',
 'Mali',
 'Malta',
 'Marshall Islands',
 'Martinique',
 'Mauritania',
 'Mauritius',
 'Mayotte',
 'Mexico',
 'Micronesia',
 'Moldova',
 'Monaco',
 'Mongolia',
 'Montenegro',
 'Morocco',
 'Mozambique',
 'Myanmar',
 'Namibia',
 'Nauru',
 'Nepal',
 'New Caledonia',
 'New Zealand',
 'Nicaragua',
 'Niger',
 'Nigeria',
 'Niue',
 'Norfolk Island',
 'Northern Mariana Islands',
 'Oman',
 'Pakistan',
 'Palau',
 'Palestine, State of',
 'Papua New Guinea',
 'Paraguay',
 'Peru',
 'Philippines',
 'Poland',
 'Portugal',
 'Puerto Rico',
 'Qatar',
 'Reunion',
 'Rwanda',
 'Saint BarthÃ©lemy',
 'Saint Helena, Ascension and Tristan da Cunha',
 'Saint Kitts and Nevis',
 'Saint Lucia',
 'Saint Martin',
 'Saint Pierre and Miquelon',
 'Saint Vincent and The Grenadines',
 'Samoa',
 'San Marino',
 'Sao Tome and Principe',
 'Saudi Arabia',
 'Senegal',
 'Serbia',
 'Seychelles',
 'Sierra Leone',
 'Singapore',
 'Sint Maarten',
 'Slovakia',
 'Slovenia',
 'Solomon Islands',
 'Somalia',
 'South Africa',
 'South Georgia and The South Sandwich Islands',
 'South Sudan',
 'Sri Lanka',
 'Sudan',
 'Suriname',
 'Switzerland',
 'Syria',
 'Taiwan',
 'Tanzania',
 'Thailand',
 'Timor-Leste',
 'Togo',
 'Tokelau',
 'Tonga',
 'Trinidad and Tobago',
 'Tunisia',
 'Turkey',
 'Turkmenistan',
 'Turks and Caicos Islands',
 'Tuvalu',
 'Uganda',
 'Ukraine',
 'United Arab Emirates',
 'United Kingdom (Great Britain)',
 'United States',
 'United States Minor Outlying Islands',
 'Uruguay',
 'Vanuatu',
 'Venezuela',
 'Viet Nam',
 'Virgin Islands, British',
 'Virgin Islands, United States',
 'Wallis and Futuna',
 'Western Sahara',
 'Yemen',
 'Zimbabwe',
 'marlal',
 'Ã…land Islands']

In [290]:
con = le.transform(
    df['country']
)
con

array([ 27,  17,   1,  41,  26,  99, 178,  45,   8, 170, 166,  66, 130,
       139, 194,  60, 184, 145,  34,  83, 175,   4, 132, 105, 104, 136,
        39, 125,  46,  48,  42,  24, 155,  56, 161,  28, 176, 188,  53,
        57, 188,  20,  62, 123, 126, 182,  47,   7, 179, 209, 190, 157,
       199, 120, 174,  73,  50, 168,  18,  31, 141,  96,  80,  80, 201,
       111,  63,  95, 114,  61, 139, 148,  89, 167,  92, 197, 146,  72,
        69,  36, 164, 166,  49,   5,  90,  88,  49, 103,  82, 176, 138,
        64,  29, 124, 161,  33,  21,  96,  50,  69, 125, 123,  20, 191,
       147, 200, 183, 127, 160, 158, 153, 199, 194, 169,   3,  54, 127,
        87,  37, 104, 100, 115,  49,  18, 100,  99, 152,  96,  83, 168,
       108, 147,  72,   9,  98, 119,  54, 112,  68, 158,  92,  52, 171,
       204, 187, 137,  13, 104,  47,  21, 162, 182, 142,  11, 139, 101,
        44,  47, 207, 112, 114, 192,  91, 103,  88,  94,  72,  65,  25,
       181,  12,  97,  78,  58, 164, 209, 206,  76, 202, 165,   1,  20,
       204,  38, 154,  21, 135,  43,  89, 110, 113,  74,  96,  75,  38,
       105,  55,  95, 150, 192, 157,  76, 144,  20,   1,  40, 100, 182,
        71, 159,  64,  69,   8,  38,  58,  67,  36, 152, 200,   3, 206,
       196,  58, 203, 155, 111, 150,  65,  66, 194, 146, 113, 159, 201,
        19,  52,  13,  96, 134,  85,  57, 111,  36, 150,  31, 159,  18,
        14, 200,  37, 143,  59,  86, 181, 144,  15,  95,  85, 192, 155,
       189, 137,  58,  70, 141,  92,  21, 150, 157,   3,  83, 171, 156,
         7,   3, 185,  52, 169, 140,  30, 164, 171,  67,  70, 189,  22,
        43,  69,  43, 150, 157, 146, 113,  53,  26, 209, 115, 100,  51,
        84,  61,  23,  83,  73,  20, 108,  81, 100,  21, 120, 123, 125,
       186, 118, 112,   1, 114, 162, 164,  83,  52, 180, 115, 133,  11,
        45,  25, 184,  66,  71, 152, 149,  54, 197, 122, 157,  39, 205,
        94, 190, 122, 170, 117, 111,  48,   2, 195,   8, 163, 108,  97,
       177, 154, 161,  17,  67,  35, 198, 172,  72,   0,  16,  84, 117,
        48,  72,  44,  19, 101,   0, 156, 145, 103, 198, 196,   6, 205,
        93, 178, 156,  27, 105,  25,  32,  77,   5, 116, 187,  95, 155,
        10,  68, 191,  52, 121,  93, 190, 145,  80,  55, 202, 191, 156,
        42,  12,  26,   6, 161, 113, 102,   1,  39,  88,  21,  84,  15,
       167,  94,  40, 184,  79, 113,  95,  35,   4,  67,  17,  14,  37,
       131, 110, 133, 128,   8, 167, 198,  35,  50, 125,  40,  30, 201,
       117,  31, 144,  75,  59, 109, 134, 135,  42, 176, 102,  23,  66,
       106, 173, 169,  86, 140, 193, 132,  66,  81,  67,  68, 129, 106,
       197,   8, 135, 151, 188, 189,  86, 152, 105, 200,  56, 206,  82,
       107, 113,  61, 124,  50,  97, 204, 159, 127, 207, 143,  24, 208])

In [291]:
df['country']= con
df

,country,gender,age,annual Salary,credit card debt,net worth,car purchase amount
0,27,0,41.851720,62812.09301,11609.380910,238961.2505,35321.45877
1,17,0,40.870623,66646.89292,9572.957136,530973.9078,45115.52566
2,1,1,43.152897,53798.55112,11160.355060,638467.1773,42925.70921
3,41,1,58.271369,79370.03798,14426.164850,548599.0524,67422.36313
4,26,1,57.313749,59729.15130,5358.712177,560304.0671,55915.46248
...,...,...,...,...,...,...,...
495,127,0,41.462515,71942.40291,6995.902524,541670.1016,48901.44342
496,207,1,37.642000,56039.49793,12301.456790,360419.0988,31491.41457
497,143,1,53.943497,68888.77805,10611.606860,764531.3203,64147.28888
498,24,1,59.160509,49811.99062,14013.034510,337826.6382,45442.15353
499,208,1,46.731152,61370.67766,9391.341628,462946.4924,45107.22566

In [292]:
from sklearn.preprocessing import OneHotEncoder

In [293]:
df['age'] = df['age'].round().astype(int)

In [294]:
df['age']

0      42
1      41
2      43
3      58
4      57
       ..
495    41
496    38
497    54
498    59
499    47
Name: age, Length: 494, dtype: int32

In [295]:
# Write your code ^_^
from sklearn.preprocessing import MinMaxScaler

scaler = MinMaxScaler().fit(df.drop(columns=['car purchase amount','country','age']))

In [296]:
scaled_data = scaler.transform(df.drop(columns=['car purchase amount','country','age']))

df1 = pd.DataFrame(scaled_data)
df1.columns = ['gender','annual Salary','credit card debt','net worth']
df1

     gender  annual Salary  credit card debt  net worth
0       0.0       0.535151          0.578361   0.223430
1       0.0       0.583086          0.476028   0.521402
2       1.0       0.422482          0.555797   0.631089
3       1.0       0.742125          0.719908   0.539387
4       1.0       0.496614          0.264257   0.551331
..      ...            ...               ...        ...
489     0.0       0.649280          0.346528   0.532316
490     1.0       0.450494          0.613139   0.347366
491     1.0       0.611110          0.528221   0.759726
492     1.0       0.372650          0.699147   0.324313
493     1.0       0.517133          0.466902   0.451986

[494 rows x 4 columns]

In [297]:
bins = [0, 18, 30, 40, 50, 100]
labels = ['0-18', '19-30', '31-40', '41-50', '51+']
agebins = pd.cut(df["age"], bins=bins, labels=labels, right=False)
df1["age"]=agebins
df1

     gender  annual Salary  credit card debt  net worth    age
0       0.0       0.535151          0.578361   0.223430  41-50
1       0.0       0.583086          0.476028   0.521402  41-50
2       1.0       0.422482          0.555797   0.631089  41-50
3       1.0       0.742125          0.719908   0.539387    51+
4       1.0       0.496614          0.264257   0.551331    51+
..      ...            ...               ...        ...    ...
489     0.0       0.649280          0.346528   0.532316    51+
490     1.0       0.450494          0.613139   0.347366  41-50
491     1.0       0.611110          0.528221   0.759726    51+
492     1.0       0.372650          0.699147   0.324313    51+
493     1.0       0.517133          0.466902   0.451986  41-50

[494 rows x 5 columns]

In [298]:
df1=df1.dropna()

In [299]:
from sklearn.preprocessing import OneHotEncoder

oh_enc = OneHotEncoder(handle_unknown='ignore')

oh_enc.fit(df1['age'].values.reshape(-1, 1))

oh_enc.categories_

[array(['19-30', '31-40', '41-50', '51+'], dtype=object)]

In [300]:
oh_data = oh_enc.transform(df1["age"].values.reshape(-1, 1)).toarray()
oh_df2 = pd.DataFrame(oh_data, columns = oh_enc.categories_)
oh_df2.head()
df1 = df1.drop(["age"], axis=1)

In [301]:
df2=pd.concat([oh_df2, df1],axis=1)
df2

,"(19-30,)","(31-40,)","(41-50,)","(51+,)",gender,annual Salary,credit card debt,net worth
0,0.0,0.0,1.0,0.0,0.0,0.535151,0.578361,0.223430
1,0.0,0.0,1.0,0.0,0.0,0.583086,0.476028,0.521402
2,0.0,0.0,1.0,0.0,1.0,0.422482,0.555797,0.631089
3,0.0,0.0,0.0,1.0,1.0,0.742125,0.719908,0.539387
4,0.0,0.0,0.0,1.0,1.0,0.496614,0.264257,0.551331
...,...,...,...,...,...,...,...,...
489,NaN,NaN,NaN,NaN,0.0,0.649280,0.346528,0.532316
490,NaN,NaN,NaN,NaN,1.0,0.450494,0.613139,0.347366
491,NaN,NaN,NaN,NaN,1.0,0.611110,0.528221,0.759726
492,NaN,NaN,NaN,NaN,1.0,0.372650,0.699147,0.324313
493,NaN,NaN,NaN,NaN,1.0,0.517133,0.466902,0.451986

In [304]:
df2 = df2.dropna()
df2

,"(19-30,)","(31-40,)","(41-50,)","(51+,)",gender,annual Salary,credit card debt,net worth
0,0.0,0.0,1.0,0.0,0.0,0.535151,0.578361,0.223430
1,0.0,0.0,1.0,0.0,0.0,0.583086,0.476028,0.521402
2,0.0,0.0,1.0,0.0,1.0,0.422482,0.555797,0.631089
3,0.0,0.0,0.0,1.0,1.0,0.742125,0.719908,0.539387
4,0.0,0.0,0.0,1.0,1.0,0.496614,0.264257,0.551331
...,...,...,...,...,...,...,...,...
482,0.0,0.0,1.0,0.0,0.0,0.519699,0.024865,0.486936
484,0.0,0.0,1.0,0.0,1.0,0.546525,0.533238,0.302172
485,0.0,0.0,0.0,1.0,1.0,0.731478,0.501130,0.280108
486,0.0,0.0,0.0,1.0,0.0,0.655310,0.489004,0.513960
487,0.0,0.0,1.0,0.0,0.0,0.720815,0.663763,0.336315

# Step 4: Train Test Split

In [305]:
X=df2
y=df['car purchase amount']

0      35321.45877
1      45115.52566
2      42925.70921
3      67422.36313
4      55915.46248
          ...
482    45015.67953
484    56510.13294
485    47443.74443
486    41489.64123
487    32553.53423
Name: car purchase amount, Length: 482, dtype: float64

In [310]:
# Write your code ^_^
X_train, X_test, y_train, y_test = train_test_split(X, y[:482], test_size=0.20, random_state = 23)

# Step 5: Build the Artifical Neural Network Model

In [312]:
# Write your code ^_^
model = Sequential()
model.add(Dense(units =32, activation = "relu", input_shape =(8,)))
model.add(Dense(units =1, activation = "linear"))
model.compile(
    optimizer ='adam',loss = 'mse',
    metrics =['accuracy','mse']
)

### Clarify Your Artificial Neural Network (ANN) Model, Optimization, and Loss Function Choices and justify

Write your anwser here

# Step 6: Train the Model

In [313]:
# Write your code ^_^
model.fit(X_train, y_train,epochs =10,batch_size =8,validation_split=0.2)

Epoch 1/10
39/39 [==============================] - 1s 5ms/step - loss: 2050519296.0000 - accuracy: 0.0000e+00 - mse: 2050519296.0000 - val_loss: 2139386752.0000 - val_accuracy: 0.0000e+00 - val_mse: 2139386752.0000
Epoch 2/10
39/39 [==============================] - 0s 2ms/step - loss: 2050455296.0000 - accuracy: 0.0000e+00 - mse: 2050455296.0000 - val_loss: 2139311488.0000 - val_accuracy: 0.0000e+00 - val_mse: 2139311488.0000
Epoch 3/10
39/39 [==============================] - 0s 2ms/step - loss: 2050366080.0000 - accuracy: 0.0000e+00 - mse: 2050366080.0000 - val_loss: 2139201792.0000 - val_accuracy: 0.0000e+00 - val_mse: 2139201792.0000
Epoch 4/10
39/39 [==============================] - 0s 2ms/step - loss: 2050238592.0000 - accuracy: 0.0000e+00 - mse: 2050238592.0000 - val_loss: 2139050624.0000 - val_accuracy: 0.0000e+00 - val_mse: 2139050624.0000
Epoch 5/10
39/39 [==============================] - 0s 2ms/step - loss: 2050069248.0000 - accuracy: 0.0000e+00 - mse: 2050069248.0000 - val_loss: 2138854784.0000 - val_accuracy: 0.0000e+00 - val_mse: 2138854784.0000
Epoch 6/10
39/39 [==============================] - 0s 2ms/step - loss: 2049857792.0000 - accuracy: 0.0000e+00 - mse: 2049857792.0000 - val_loss: 2138614400.0000 - val_accuracy: 0.0000e+00 - val_mse: 2138614400.0000
Epoch 7/10
39/39 [==============================] - 0s 2ms/step - loss: 2049600512.0000 - accuracy: 0.0000e+00 - mse: 2049600512.0000 - val_loss: 2138328576.0000 - val_accuracy: 0.0000e+00 - val_mse: 2138328576.0000
Epoch 8/10
39/39 [==============================] - 0s 2ms/step - loss: 2049296896.0000 - accuracy: 0.0000e+00 - mse: 2049296896.0000 - val_loss: 2137989632.0000 - val_accuracy: 0.0000e+00 - val_mse: 2137989632.0000
Epoch 9/10
39/39 [==============================] - 0s 2ms/step - loss: 2048939008.0000 - accuracy: 0.0000e+00 - mse: 2048939008.0000 - val_loss: 2137600000.0000 - val_accuracy: 0.0000e+00 - val_mse: 2137600000.0000
Epoch 10/10
39/39 [==============================] - 0s 2ms/step - loss: 2048533888.0000 - accuracy: 0.0000e+00 - mse: 2048533888.0000 - val_loss: 2137159552.0000 - val_accuracy: 0.0000e+00 - val_mse: 2137159552.0000

# Step 7: Evaluate the Model

In [314]:
model.evaluate(X_test, y_test)

4/4 [==============================] - 0s 2ms/step - loss: 1983014016.0000 - accuracy: 0.0000e+00 - mse: 1983014016.0000

[1983014016.0, 0.0, 1983014016.0]

In [ ]:
# Write your code ^_^

# Step 8: Build the Deep Neural Network Model

In [316]:
# Write your code ^_^
modelD = Sequential()
modelD.add(Dense(units =32, activation = "tanh", input_shape =(8,)))
modelD.add(Dense(units =16, activation = "tanh"))
modelD.add(Dense(units =8, activation = "tanh"))
modelD.add(Dense(units =1, activation = "linear"))
modelD.compile(
    optimizer ='adam',loss = 'mse',
    metrics =['accuracy','mse']
)

### Clarify Your Deep Neural Network (DNN) Model, Optimization, and Loss Function Choices and justify

Write your anwser here

# Step 9: Train the Model

In [317]:
# Write your code ^_^# Write your code ^_^
modelD.fit(X_train, y_train,epochs =10,batch_size =16,validation_split=0.20)

Epoch 1/10
20/20 [==============================] - 1s 9ms/step - loss: 2050497152.0000 - accuracy: 0.0000e+00 - mse: 2050497152.0000 - val_loss: 2139325440.0000 - val_accuracy: 0.0000e+00 - val_mse: 2139325440.0000
Epoch 2/10
20/20 [==============================] - 0s 2ms/step - loss: 2050385280.0000 - accuracy: 0.0000e+00 - mse: 2050385280.0000 - val_loss: 2139221248.0000 - val_accuracy: 0.0000e+00 - val_mse: 2139221248.0000
Epoch 3/10
20/20 [==============================] - 0s 2ms/step - loss: 2050291584.0000 - accuracy: 0.0000e+00 - mse: 2050291584.0000 - val_loss: 2139139456.0000 - val_accuracy: 0.0000e+00 - val_mse: 2139139456.0000
Epoch 4/10
20/20 [==============================] - 0s 2ms/step - loss: 2050223488.0000 - accuracy: 0.0000e+00 - mse: 2050223488.0000 - val_loss: 2139084032.0000 - val_accuracy: 0.0000e+00 - val_mse: 2139084032.0000
Epoch 5/10
20/20 [==============================] - 0s 2ms/step - loss: 2050176768.0000 - accuracy: 0.0000e+00 - mse: 2050176768.0000 - val_loss: 2139044864.0000 - val_accuracy: 0.0000e+00 - val_mse: 2139044864.0000
Epoch 6/10
20/20 [==============================] - 0s 2ms/step - loss: 2050143104.0000 - accuracy: 0.0000e+00 - mse: 2050143104.0000 - val_loss: 2139014656.0000 - val_accuracy: 0.0000e+00 - val_mse: 2139014656.0000
Epoch 7/10
20/20 [==============================] - 0s 2ms/step - loss: 2050115712.0000 - accuracy: 0.0000e+00 - mse: 2050115712.0000 - val_loss: 2138988800.0000 - val_accuracy: 0.0000e+00 - val_mse: 2138988800.0000
Epoch 8/10
20/20 [==============================] - 0s 2ms/step - loss: 2050092288.0000 - accuracy: 0.0000e+00 - mse: 2050092288.0000 - val_loss: 2138965888.0000 - val_accuracy: 0.0000e+00 - val_mse: 2138965888.0000
Epoch 9/10
20/20 [==============================] - 0s 2ms/step - loss: 2050070144.0000 - accuracy: 0.0000e+00 - mse: 2050070144.0000 - val_loss: 2138944384.0000 - val_accuracy: 0.0000e+00 - val_mse: 2138944384.0000
Epoch 10/10
20/20 [==============================] - 0s 2ms/step - loss: 2050049664.0000 - accuracy: 0.0000e+00 - mse: 2050049664.0000 - val_loss: 2138923776.0000 - val_accuracy: 0.0000e+00 - val_mse: 2138923776.0000

# Step 10: Evaluate the Model

In [318]:
# Write your code ^_^
modelD.evaluate(X_test, y_test)

4/4 [==============================] - 0s 2ms/step - loss: 1984694784.0000 - accuracy: 0.0000e+00 - mse: 1984694784.0000

[1984694784.0, 0.0, 1984694784.0]

# Step 11: Evaluate and Compare Scores, Training Time, and Prediction Time of ANN/DNN Models

In [319]:
# Write your code ^_^
print('*'*6,'Score','*'*6)
print('ANN: 0')
print('DNN: 0')
print('*'*6,'Training Time','*'*6)
print('ANN: 1.1s')
print('DNN: 1.4s')
print('*'*6,'Prediction Time','*'*6)
print('ANN: 2ms')
print('DNN: 2ms')

****** Score ******
ANN: 0
DNN: 0
****** Training Time ******
ANN: 1.1s
DNN: 1.4s
****** Prediction Time ******
ANN: 2ms
DNN: 2ms